[
  {
    "company_name": "ICBC",
    "address": "No.55 FuXingMenNei Street, Xicheng District, Beijing",
    "postal_code": "100140",
    "industry": "Banking",
    "ceo_name": "Shu Gu",
    "city": "Beijing",
    "company_logo": "https://upload.wikimedia.org/wikipedia/en/thumb/3/33/Industrial_and_Commercial_Bank_of_China_logo.svg/2880px-Industrial_and_Commercial_Bank_of_China_logo.svg.png",
    "competitors": "SBC, Agricultural Bank of China, HDFC",
    "country_name": "China",
    "description": "Industrial and Commercial Bank of China (ICBC) is a Chinese multinational banking company, and the largest bank in the world by total assets and by market capitalization. It is one of China’s ‘Big Four’ state-owned commercial banks. Industrial and Commercial Bank of China was established on 1 January 1984. On 28 October 2005, the Bank was wholly restructured to a joint-stock limited company. On 27 October 2006, the Bank was successfully listed on both Shanghai Stock Exchange and The Stock Exchange of Hong Kong Limited. Through its continuous endeavor and stable development, the Bank has developed into the leading bank in the world, possessing an excellent customer base, a diversified business structure, strong innovation capabilities and market competitiveness. The Bank regards service as the very foundation to seek further development and adheres to creating value through services while providing a comprehensive range of financial products and services to 8,098 thousand corporate customers and 650 million personal customers. The Bank has been consciously integrating the social responsibilities with its development strategy and operation and management activities, and gaining wide recognition in the aspects of promoting inclusive finance, supporting targeted poverty relief, protecting environment and resources and participating in public welfare undertakings. The Bank was ranked the 1st place among the Top 1000 World Banks by The Banker, ranked 1st place in the Global 2000 listed by Forbes and topped the sub-list of commercial banks of the Global 500 in Fortune for the seventh consecutive year, and took the 1st place among the Top 500 Banking Brands of Brand Finance for the fourth consecutive year.",
    "facebook": "https://www.facebook.com/theICBC",
    "founded": 1984,
    "headquarters": "Xicheng District, Beijing, China",
    "employees": 434798,
    "market_cap": "$250B",
    "revenue": "$191B",
    "phone": "1-800-663-3051",
    "phone_toll_free": "1-800-910-4222",
    "url": "http://www.icbc-ltd.com",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Industrial_and_Commercial_Bank_of_China",
    "data_website": "http://www.icbc-ltd.com",
    "data_headquarters": "Xicheng District, Beijing, China",
    "data_employees": 434798,
    "data_industry": "Banking",
    "data_revenue": "$191B",
    "data_founded": 1984,
    "data_competitors": "SBC, Agricultural Bank of China, HDFC"
  },
  {
    "company_name": "JPMorgan Chase",
    "address": "383 Madison Ave",
    "postal_code": "10017",
    "industry": "Diversified Financials",
    "ceo_name": "Jamie Dimon",
    "city": "New York",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/J_P_Morgan_Chase_Logo_2008_1.svg/2880px-J_P_Morgan_Chase_Logo_2008_1.svg.png",
    "competitors": "State Street, Morgan Stanley, Goldman Sachs, HSBC, Citi, Wells Fargo, Bank of America",
    "country_name": "USA",
    "description": "JPMorgan Chase & Co. is a financial holding company. It provides financial and investment banking services. The firm offers a range of investment banking products and services in all capital markets, including advising on corporate strategy and structure, capital raising in equity and debt markets, risk management, market making in cash securities and derivative instruments, and brokerage and research. It operates through the following segments: Consumer and Community Banking, Corporate and Investment Bank, Commercial. Banking and Asset and Wealth Management. The Consumer and Community Banking segment serves consumers and businesses through personal service at bank branches and through automated teller machine, online, mobile, and telephone banking. The Corporate and Investment Bank segment offers a suite of investment banking, market-making, prime brokerage, and treasury and securities products and services to a global client base of corporations, investors, financial institutions, government and municipal entities. The Commercial Banking segment delivers services to U.S. and its multinational clients, including corporations, municipalities, financial institutions, and non profit entities. It also provides financing to real estate investors and owners as well as financial solutions, including lending, treasury services, investment banking, and asset management. The Asset and Wealth Management segment provides asset and wealth management services.",
    "facebook": "https://www.facebook.com/jpmorganchase",
    "founded": 2000,
    "headquarters": "New York, USA",
    "employees": 255351,
    "market_cap": "$496B",
    "revenue": "$30B",
    "phone": "+1 212-270-6000",
    "phone_toll_free": "1-800-935-9935",
    "url": "https://www.jpmorganchase.com",
    "wikipedia_url": "https://en.wikipedia.org/wiki/JPMorgan_Chase",
    "data_website": "https://www.jpmorganchase.com",
    "data_headquarters": "New York, USA",
    "data_employees": 255351,
    "data_industry": "Diversified Financials",
    "data_revenue": "$30B",
    "data_founded": 2000,
    "data_competitors": "State Street, Morgan Stanley, Goldman Sachs, HSBC, Citi, Wells Fargo, Bank of America"
  },
  {
    "company_name": "Berkshire Hathaway Inc.",
    "address": "3555 Farnam Street",
    "postal_code": "68131",
    "industry": "Diversified Financials",
    "ceo_name": "Warren Edward Buffett",
    "city": "Omaha",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Berkshire_Hathaway.svg/2880px-Berkshire_Hathaway.svg.png",
    "competitors": "The Carlyle Group, BlackRock, Allstate, Howard Hanna Real Estate Services, Allegheny Technologies",
    "country_name": "USA",
    "description": "Berkshire Hathaway, Inc. provides property and casualty insurance and reinsurance, utilities and energy, freight rail transportation, finance, manufacturing, retailing, and services. It operates through following segments: GEICO, Berkshire Hathaway Reinsurance Group, Berkshire Hathaway Primary Group, Burlington Northern Santa Fe, LLC (BNSF), Berkshire Hathaway Energy, McLane Company, Manufacturing, and Service and Retailing. The GEICO segments involves in underwriting private passenger automobile insurance mainly by direct response methods. The Berkshire Hathaway Reinsurance Group segment consists of underwriting excess-of-loss and quota-share and facultative reinsurance worldwide. The Berkshire Hathaway Primary Group segment comprises of underwriting multiple lines of property and casualty insurance policies for primarily commercial accounts. The BNSF segment operates railroad systems in North America. The Berkshire Hathaway Energy segments deals with regulated electric and gas utility, including power generation and distribution activities, and real estate brokerage activities. The McLane Company segment offers wholesale distribution of groceries and non-food items. The Manufacturing segment includes industrial and end-user products, building products, and apparel. The Service and Retailing segment provides fractional aircraft ownership programs, aviation pilot training, electronic components distribution, and various retailing businesses, including automobile dealerships, and trailer and furniture leasing.", 
    "facebook": "https://www.facebook.com/Berkshire-Hathaway-197156603629843",
    "founded": 1955,
    "headquarters": "Nebraska, USA",
    "employees": 360000,
    "market_cap": "$246B",
    "revenue": "$246B",
    "phone": "1-888-395-6349",
    "phone_toll_free": "1-402-346-1400",
    "url": "https://www.berkshirehathaway.com",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Berkshire_Hathaway",
    "data_website": "https://www.berkshirehathaway.com",
    "data_headquarters": "Nebraska, USA",
    "data_employees": 360000,
    "data_industry": "Diversified Financials",
    "data_revenue": "$246B",
    "data_founded": 1955,
    "data_competitors": "The Carlyle Group, BlackRock, Allstate, Howard Hanna Real Estate Services, Allegheny Technologies"
  },
  {
    "company_name": "China Construction Bank",
    "address": "No. 25, Finance Street",
    "postal_code": "100033",
    "industry": "Banking",
    "ceo_name": "Wang Zuji",
    "city": "Beijing",
    "company_logo": "https://upload.wikimedia.org/wikipedia/en/thumb/e/e8/China_Construction_Bank.svg/2880px-China_Construction_Bank.svg.png",
    "competitors": "SBC, Agricultural Bank of China, HDFC",
    "country_name": "China",
    "description": "China Construction Bank Corp. engages in the provision of a wide range of financial services to corporate and personal customers. It operates through the following business segments: Corporate Banking, Personal Banking, Treasury, and Others. The Corporate Banking segment provides a range of financial products and services to corporations, government agencies and financial institutions, which comprises of corporate loans, trade financing, deposit taking and wealth management services, agency services, financial consulting and advisory services, cash management services, remittance and settlement services, custody services, and guarantee services. The Personal Banking segment provides personal loans, deposit taking and wealth management services, card business, remittance services, and agency services to individual customers. The Treasury segment represents inter-bank money market transactions, repurchase and resale transactions, investments in debt securities, and trade of derivatives and foreign currency. The Others segment refers to equity investments and revenues, results, assets and liabilities of overseas branches and subsidiaries.",
    "facebook": "https://www.facebook.com/China-Construction-Bank-384180208783122/",
    "founded": 2014,
    "headquarters": "Beijing, China",
    "employees": 347156,
    "market_cap": "$210B",
    "revenue": "$174B",
    "phone": "",
    "phone_toll_free": "1-852-2779-5533",
    "url": "http://www.ccb.com/",
    "wikipedia_url": "https://en.wikipedia.org/wiki/China_Construction_Bank",
    "data_website": "http://www.ccb.com/",
    "data_headquarters": "Beijing, China",
    "data_employees": 347156,
    "data_industry": "Banking",
    "data_revenue": "$174B",
    "data_founded": 2014,
    "data_competitors": "SBC, Agricultural Bank of China, HDFC"
  },
  {
    "company_name": "Saudi Arabian Oil Company",
    "address": "PO Box 5000 North Admin Building",
    "postal_code": "31311",
    "industry": "Oil & Gas",
    "ceo_name": "Amin bin Hassan Al-Nasser",
    "city": "Dhahran",
    "company_logo": "https://upload.wikimedia.org/wikipedia/en/thumb/a/a7/Saudi_Aramco_logo.svg/2880px-Saudi_Aramco_logo.svg.png",
    "competitors": "Exxon Mobil, Shell, BP, Total, ADNOC, Chevron, ConocoPhillips",
    "country_name": "Saudi Arabia",
    "description": "Saudi Arabian Oil Co. engages in the exploration, production, transportation, and sale of crude oil and natural gas. It operates through the following segments: Upstream, Downstream, and Corporate. The Upstream segment i The Corporate segment offers supporting services including human resources, finance, and information technology.ncludes crude oil, natural gas and natural gas liquids exploration, field development, and production. The Downstream segment focuses on refining, logistics, power generation, and the marketing of crude oil, petroleum and petrochemical products, and related services to international and domestic customers.",
    "facebook": "https://www.facebook.com/aramco/",
    "founded": 1933,
    "headquarters": "Dhahran, Saudi Arabia",
    "employees": 66800,
    "market_cap": "$1.9T",
    "revenue": "$230B",
    "phone": "966-11-297-8775",
    "phone_toll_free": "",
    "url": "https://www.aramco.com",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Saudi_Aramco",
    "data_website": "https://www.aramco.com",
    "data_headquarters": "Dhahran, Saudi Arabia",
    "data_employees": 66800,
    "data_industry": "Oil & Gas",
    "data_revenue": "$230B",
    "data_founded": 1933,
    "data_competitors": "Exxon Mobil, Shell, BP, Total, ADNOC, Chevron, ConocoPhillips"
  },
  {
    "company_name": "Apple",
    "address": "1 Apple Park Way",
    "postal_code": "95014",
    "industry": "Technology Hardware & Equipment",
    "ceo_name": "Tim Cook",
    "city": "Cupertino",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Apple_logo_black.svg/1280px-Apple_logo_black.svg.png",
    "competitors": "Samsung, Microsoft, Dell, Lenovo, HP, Sony, Asus, Xiaomi, Huawei, Oppo",
    "country_name": "USA",
    "description": "Apple, Inc. engages in the design, manufacture, and sale of smartphones, personal computers, tablets, wearables and accessories, and other variety of related services. It operates through the following geographical segments: Americas, Europe, Greater China, Japan, and Rest of Asia Pacific. The Americas segment includes North and South America. The Europe segment consists of European countries, as well as India, the Middle East, and Africa. The Greater China segment comprises of China, Hong Kong, and Taiwan. The Rest of Asia  Pacific segment includes Australia and Asian countries. Its products and services include iPhone, Mac, iPad, AirPods, Apple TV, Apple Watch, Beats products, Apple Care, iCloud, digital content stores, streaming, and licensing services. The company was founded by Steven Paul Jobs, Ronald Gerald Wayne, and Stephen G. Wozniak.",
    "facebook": "",
    "founded": 1976,
    "headquarters": "California, USA",
    "employees": 147000,
    "market_cap": "$2.098T",
    "revenue": "$294B",
    "phone": "+1 (408) 996- 1010",
    "phone_toll_free": "",
    "url": "https://www.apple.com",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Apple_Inc.",
    "data_website": "https://www.apple.com",
    "data_headquarters": "California, USA",
    "data_employees": 147000,
    "data_industry": "Technology Hardware & Equipment",
    "data_revenue": "$294B",
    "data_founded": 1976,
    "data_competitors": "Samsung, Microsoft, Dell, Lenovo, HP, Sony, Asus, Xiaomi, Huawei, Oppo"
  },
  {
    "company_name": "Bank of America",
    "address": "100 North Tryon Street",
    "postal_code": "28255",
    "industry": "Banking",
    "ceo_name": "Brian Moynihan",
    "city": "Charlotte",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Bank_of_America_logo.svg/2880px-Bank_of_America_logo.svg.png",
    "competitors": "SBC, Agricultural Bank of China, HDFC, CMB, Wellington Management, Citi, BoCD, Wells Fargo, UBS, ICBC",
    "country_name": "USA",
    "description": "Bank of America Corp. is a bank and financial holding company, which engages in the provision of banking and nonbank financial services. It operates through the following segments: Consumer Banking, Global Wealth and Investment Management, Global Banking, Global Markets, and All Other. The Consumer Banking segment offers credit, banking, and investment products and services to consumers and small businesses. The Global Wealth and Investment Management provides client experience through a network of financial advisors focused on to meet their needs through a full set of investment management, brokerage, banking, and retirement products. The Global Banking segment deals with lending-related products and services, integrated working capital management and treasury solutions to clients, and underwriting and advisory services. The Global Markets segment includes sales and trading services, as well as research, to institutional clients across fixed-income, credit, currency, commodity, and equity businesses. The All Other segment consists of asset and liability management activities, equity investments, non-core mortgage loans and servicing activities, the net impact of periodic revisions to the mortgage servicing rights (MSR) valuation model for both core and non-core MSRs, other liquidating businesses, residual expense allocations and other.",
    "facebook": "https://www.facebook.com/BankofAmerica",
    "founded": 1904,
    "headquarters": "North Carolina, USA",
    "employees": 213000,
    "market_cap": "$366B",
    "revenue": "$99B",
    "phone": "",
    "phone_toll_free": "+1(866)607-1234",
    "url": "https://www.bankofamerica.com",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Bank_of_America",
    "data_website": "https://www.bankofamerica.com",
    "data_headquarters": "North Carolina, USA",
    "data_employees": 213000,
    "data_industry": "Banking",
    "data_revenue": "$99B",
    "data_founded": 1904,
    "data_competitors": "SBC, Agricultural Bank of China, HDFC, CMB, Wellington Management, Citi, BoCD, Wells Fargo, UBS, ICBC"
  },
  {
    "company_name": "Amazon",
    "address": "410 Terry Ave. North",
    "postal_code": "98109",
    "industry": "Retailing",
    "ceo_name": "Jeffrey P. Bezos",
    "city": "Seattle",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Amazon_logo.svg/2880px-Amazon_logo.svg.png",
    "competitors": "Target, Walmart, Best Buy, and Costco",
    "country_name": "USA",
    "description": "Amazon.com, Inc. engages in the provision of online retail shopping services. It operates through the following business segments: North America, International, and Amazon Web Services (AWS). The North America segment includes retail sales of consumer products and subscriptions through North America-focused websites such as www.amazon.com and www.amazon.ca. The International segment offers retail sales of consumer products and subscriptions through internationally-focused websites. The Amazon Web Services segment involves in the global sales of compute, storage, database, and AWS service offerings for start-ups, enterprises, government agencies, and academic institutions.",
    "facebook": "https://www.facebook.com/Amazon",
    "founded": 1994,
    "headquarters": "Washington, USA",
    "employees": 1298000,
    "market_cap": "$1.65T",
    "revenue": "$386B",
    "phone": "+1(206)266-1000",
    "phone_toll_free": "",
    "url": "https://www.amazon.com",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Amazon_(company)",
    "data_website": "https://www.amazon.com",
    "data_headquarters": "Washington, USA",
    "data_employees": 1298000,
    "data_industry": "Retailing",
    "data_revenue": "$386B",
    "data_founded": 1994,
    "data_competitors": "Target, Walmart, Best Buy, and Costco"
  },
  {
    "company_name": "Samsung Electronics",
    "address": "1077, Cheono-daero, Gangdong-gu",
    "postal_code": "5340",
    "industry": "Consumer and Industry Electronics",
    "ceo_name": "Hyun-Suk Kim, Kinam Kim",
    "city": "Suwon",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Samsung_wordmark.svg/2880px-Samsung_wordmark.svg.png",
    "competitors": "Apple, LG Electronics, Sony, HTC, Huawei Technologies, Intel, Electrolux, Lenovo Group Limited, Panasonic",
    "country_name": "Korea",
    "description": "Samsung Electronics Co., Ltd. engages in the manufacturing and selling of electronics and computer peripherals. The company operates through following business divisions: Consumer Electronics, Information Technology & Mobile Communications and Device Solutions. The Consumer Electronics business division provides cable television, monitor, printer, air-conditioners, refrigerators, washing machines and medical devices. The Information Technology & Mobile Communications business division offers handheld products, communication systems, computers and digital cameras. The Device Solutions business division comprises of memory, system large scale integrated circuit and light emitting diode.",
    "facebook": "https://www.facebook.com/Samsung",
    "founded": 1938,
    "headquarters": "Suwon, Korea",
    "employees": 109000,
    "market_cap": "$477.7B",
    "revenue": "$200B",
    "phone": "+82-2-2053-3000",
    "phone_toll_free": "",
    "url": "https://www.samsung.com",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Samsung",
    "data_website": "https://www.samsung.com",
    "data_headquarters": "Suwon, Korea",
    "data_employees": 109000,
    "data_industry": "Consumer and Industry Electronics",
    "data_revenue": "$200B",
    "data_founded": 1938,
    "data_competitors": "Apple, LG Electronics, Sony, HTC, Huawei Technologies, Intel, Electrolux, Lenovo Group Limited, Panasonic"
  },
  {
    "company_name": "Microsoft",
    "address": "1 Microsoft Way",
    "postal_code": "98052",
    "industry": "IT Software & Services",
    "ceo_name": "Satya Nadella",
    "city": "Redmond",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Microsoft_logo_%282012%29.svg/2880px-Microsoft_logo_%282012%29.svg.png",
    "competitors": "Apple, Cisco, Google, Facebook, IBM, Oracle, Salesforce, SAP, Okta, Proofpoint",
    "country_name": "USA",
    "description": "Microsoft Corp. engages in the development and support of software, services, devices, and solutions. It operates through the following business segments: Productivity and Business Processes; Intelligent Cloud; and More Personal Computing. The Productivity and Business Processes segment comprises products and services in the portfolio of productivity, communication, and information services of the company spanning a variety of devices and platform. The Intelligent Cloud segment refers to the public, private, and hybrid serve products and cloud services of the company which can power modern business. The More Personal Computing segment encompasses products and services geared towards the interests of end users, developers, and IT professionals across all devices. The firm also offers operating systems; cross-device productivity applications; server applications; business solution applications; desktop and server management tools; software development tools; video games; personal computers, tablets; gaming and entertainment consoles; other intelligent devices; and related accessories.",  
    "facebook": "https://www.facebook.com/Microsoft",
    "founded": 1975,
    "headquarters": "Washington, USA",
    "employees": 163000,
    "market_cap": "$1.85T",
    "revenue": "$153B",
    "phone": "+1 425-882-8080",
    "phone_toll_free": "",
    "url": "https://www.microsoft.com",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Microsoft",
    "data_website": "https://www.microsoft.com",
    "data_headquarters": "Washington, USA",
    "data_employees": 163000,
    "data_industry": "IT Software & Services",
    "data_revenue": "$153B",
    "data_founded": 1975,
    "data_competitors": "Apple, Cisco, Google, Facebook, IBM, Oracle, Salesforce, SAP, Okta, Proofpoint"
  }
]