[
  {
    "full_name": "Jeff Bezos",
    "location": "Seattle",
    "industry": "Retail",
    "founder_of": "Amazon",
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Jeff_Bezos_at_Amazon_Spheres_Grand_Opening_in_Seattle_-_2018_%2839074799225%29_%28cropped%29.jpg",
    "about": "Jeffrey Preston Bezos; born January 12, 1964 is an American internet entrepreneur, businessman, media proprietor, and investor. Bezos is the founder and CEO of the multi-national technology company Amazon. With a net worth of more than $200 billion as of April 2021, he is the richest person in the world according to both Forbes and Bloomberg's Billionaires Index. Born in Albuquerque and raised in Houston and later Miami, Bezos graduated from Princeton University in 1986. He holds a degree in electrical engineering and computer science. He worked on Wall Street in a variety of related fields from 1986 to early 1994. Bezos founded Amazon in late 1994, on a cross-country road trip from New York City to Seattle. The company began as an online bookstore and has since expanded to a wide variety of other e-commerce products and services, including video and audio streaming, cloud computing, and artificial intelligence. It is currently the world's largest online sales company, the largest Internet company by revenue, and the world's largest provider of virtual assistants and cloud infrastructure services through its Amazon Web Services branch. Bezos founded the aerospace manufacturer and sub-orbital spaceflight services company Blue Origin in 2000. Blue Origin's New Shepard vehicle reached space in 2015, and afterwards successfully landed back on Earth. The company has upcoming plans to begin commercial suborbital human spaceflight. He also purchased the major American newspaper The Washington Post in 2013 for $250 million, and manages many other investments through his Bezos Expeditions venture capital firm. The first centibillionaire on the Forbes wealth index, Bezos was named the 'richest man in modern history' after his net worth increased to $150 billion in July 2018. In August 2020, according to Forbes, he had a net worth exceeding $200 billion. In 2020 during the COVID-19 pandemic, Bezos's wealth grew by approximately $24 billion. On February 2, 2021, Bezos announced that he would step down as the CEO of Amazon sometime in the third quarter of 2021, and transition into the role of executive chairman. He is due to be replaced as CEO by Andy Jassy, the chief of Amazon's cloud computing division.",
    "company_website": "https://www.amazon.com",
    "country": "USA",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Amazon_logo.svg/2880px-Amazon_logo.svg.png",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Jeff_Bezos",
    "net_worth": "$200B"
  },
  {
    "full_name": "Elon Musk",
    "location": "California",
    "industry": "Automotive",
    "founder_of": "Tesla",
    "image": "https://upload.wikimedia.org/wikipedia/commons/8/85/Elon_Musk_Royal_Society_%28crop1%29.jpg",
    "about": "Elon Reeve Musk born June 28, 1971 is a business magnate, industrial designer, and engineer. He is the founder, CEO, CTO, and chief designer of SpaceX; early stage investor, CEO, and product architect of Tesla, Inc.; founder of The Boring Company; and co-founder of Neuralink and OpenAI. A centibillionaire, Musk is one of the richest people in the world. Musk was born to a Canadian mother and South African father and raised in Pretoria, South Africa. He briefly attended the University of Pretoria before moving to Canada aged 17 to attend Queen's University. He transferred to the University of Pennsylvania two years later, where he received bachelor's degrees in economics and physics. He moved to California in 1995 to attend Stanford University but decided instead to pursue a business career, co-founding the web software company Zip2 with his brother Kimbal. The startup was acquired by Compaq for $307 million in 1999. Musk co-founded online bank X.com that same year, which merged with Confinity in 2000 to form PayPal. The company was bought by eBay in 2002 for $1.5 billion. In 2002, Musk founded SpaceX, an aerospace manufacturer and space transport services company, of which he is CEO, CTO, and lead designer. In 2004, he joined electric vehicle manufacturer Tesla Motors, Inc. (now Tesla, Inc.) as chairman and product architect, becoming its CEO in 2008. In 2006, he helped create SolarCity, a solar energy services company that was later acquired by Tesla and became Tesla Energy. In 2015, he co-founded OpenAI, a nonprofit research company that promotes friendly artificial intelligence. In 2016, he co-founded Neuralink, a neurotechnology company focused on developing brain–computer interfaces, and founded The Boring Company, a tunnel construction company. Musk has proposed the Hyperloop, a high-speed vactrain transportation system. Musk has been the subject of criticism due to unorthodox or unscientific stances and highly publicized controversies. In 2018, he was sued for defamation by a diver who advised in the Tham Luang cave rescue; a California jury ruled in favor of Musk. In the same year, he was sued by the US Securities and Exchange Commission (SEC) for falsely tweeting that he had secured funding for a private takeover of Tesla. He settled with the SEC, temporarily stepping down from his chairmanship and accepting limitations on his Twitter usage. Musk has spread misinformation about the COVID-19 pandemic and has received criticism from experts for his other views on such matters as artificial intelligence and public transport.",
    "company_website": "https://www.tesla.com",
    "country": "USA",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Tesla_Motors.svg/1024px-Tesla_Motors.svg.png",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Elon_Musk",
    "net_worth": "$147B"
  },
  {
    "full_name": "Bill Gates",
    "location": "Washington",
    "industry": "IT Software & Services",
    "founder_of": "Microsoft",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Bill_Gates_2017_%28cropped%29.jpg/1024px-Bill_Gates_2017_%28cropped%29.jpg",
    "about": "William Henry Gates III; born October 28, 1955 is an American business magnate, software developer, investor, author, and philanthropist. He is the co-founder of Microsoft Corporation. During his career at Microsoft, Gates held the positions of chairman, chief executive officer (CEO), president and chief software architect, while also being the largest individual shareholder until May 2014.He is considered one of the best known entrepreneurs of the microcomputer revolution of the 1970s and 1980s. Gates was born and raised in Seattle, Washington. In 1975, he co-founded Microsoft with childhood friend Paul Allen in Albuquerque, New Mexico. It became the world's largest personal computer software company. Gates led the company as chairman and CEO until stepping down as CEO in January 2000, succeeded by Steve Ballmer, but he remained chairman of the board of directors and became chief software architect. During the late 1990s, he had been criticized for his business tactics, which have been considered anti-competitive. This opinion has been upheld by numerous court rulings. In June 2008, Gates transitioned to a part-time role at Microsoft and full-time work at the Bill & Melinda Gates Foundation, the private charitable foundation he and his wife, Melinda Gates, established in 2000. He stepped down as chairman of the board of Microsoft in February 2014 and assumed a new post as technology adviser to support the newly appointed CEO Satya Nadella. In March 2020, Gates left his board positions at Microsoft and Berkshire Hathaway to focus on his philanthropic efforts including climate change, global health and development, and education. Since 1987, Bill Gates has been included in the Forbes list of the world's wealthiest people. From 1995 to 2017, he held the Forbes title of the richest person in the world every year except from 2010 to 2013. In October 2017, he was surpassed by Amazon founder and CEO Jeff Bezos, who had an estimated net worth of US$90.6 billion compared to Gates's net worth of US$89.9 billion at the time. As of May 2021, Gates had an estimated net worth of US$144 billion, making him the fourth-richest person in the world. Later in his career and since leaving day-to-day operations at Microsoft in 2008, Gates has pursued many business and philanthropic endeavors. He is the founder and chairman of several companies, including BEN, Cascade Investment, bgC3, and TerraPower. He has given sizable amounts of money to various charitable organizations and scientific research programs through the Bill & Melinda Gates Foundation, reported to be the world's largest private charity. Through the foundation, he led an early 21st century vaccination campaign which significantly contributed to the eradication of the wild poliovirus in Africa. In 2010, Gates and Warren Buffett founded The Giving Pledge, whereby they and other billionaires pledge to give at least half of their wealth to philanthropy.",
    "company_website": "https://www.microsoft.com",
    "country": "USA",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Microsoft_logo_%282012%29.svg/2880px-Microsoft_logo_%282012%29.svg.png",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Bill_Gates",
    "net_worth": "$144B"
  },
  {
    "full_name": "Mark Zuckerberg",
    "location": "California",
    "industry": "Social Media",
    "founder_of": "Facebook",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Mark_Zuckerberg_F8_2019_Keynote_%2832830578717%29_%28cropped%29.jpg/1024px-Mark_Zuckerberg_F8_2019_Keynote_%2832830578717%29_%28cropped%29.jpg",
    "about": "Mark Elliot Zuckerberg; born May 14, 1984 is an American media magnate, internet entrepreneur, and philanthropist. He is known for co-founding Facebook, Inc. and serves as its chairman, chief executive officer, and controlling shareholder. He also is a co-founder of the solar sail spacecraft development project Breakthrough Starshot and serves as one of its board members. Born in White Plains, New York, Zuckerberg attended Harvard University, where he launched the Facebook social networking service from his dormitory room on February 4, 2004, with college roommates Eduardo Saverin, Andrew McCollum, Dustin Moskovitz, and Chris Hughes. Originally launched to select college campuses, the site expanded rapidly and eventually beyond colleges, reaching one billion users by 2012. Zuckerberg took the company public in May 2012 with majority shares. In 2007, at age 23, he became the world's youngest self-made billionaire. As of May 2021, Zuckerberg's net worth is $117.8 billion, making him the 5th-richest person in the world. Since 2008, Time magazine has named Zuckerberg among the 100 most influential people in the world as a part of its Person of the Year award. In December 2016, Zuckerberg was ranked 10th on Forbes list of The World's Most Powerful People.",
    "company_website": "https://www.facebook.com",
    "country": "USA",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Facebook_f_logo_%282019%29.svg/1280px-Facebook_f_logo_%282019%29.svg.png",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Mark_Zuckerberg",
    "net_worth": "$117B"
  },
  {
    "full_name": "Warren Buffet",
    "location": "Nebraska",
    "industry": "Diversified Financials",
    "founder_of": "Berkshire Hathaway",
    "image": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Warren_Buffett_with_Fisher_College_of_Business_Student_-_4395161160_%28cropped%29.jpg",
    "about": "Warren Edward Buffett; born August 30, 1930 is an American investor, business tycoon, philanthropist, and the chairman and CEO of Berkshire Hathaway. He is considered one of the most successful investors in the world and has a net worth of over $100.6 billion as of April 2021, making him the world's seventh-wealthiest person. Buffett was born in Omaha, Nebraska. He developed an interest in business and investing in his youth, eventually entering the Wharton School of the University of Pennsylvania in 1947 before transferring to and graduating from the University of Nebraska at 19. He went on to graduate from Columbia Business School, where he molded his investment philosophy around the concept of value investing pioneered by Benjamin Graham. He attended New York Institute of Finance to focus his economics background and soon after began various business partnerships, including one with Graham. He created Buffett Partnership, Ltd in 1956 and his firm eventually acquired a textile manufacturing firm called Berkshire Hathaway, assuming its name to create a diversified holding company. In 1978, Charlie Munger joined Buffett as vice-chairman. Buffett has been the chairman and largest shareholder of Berkshire Hathaway since 1970. He has been referred to as the 'Oracle' or 'Sage' of Omaha by global media.He is noted for his adherence to value investing, and his personal frugality despite his immense wealth. Research published at the University of Oxford characterizes Buffett's investment methodology as falling within 'founder centrism', defined by a deference to managers with a founder's mindset, an ethical disposition towards the shareholder collective, and an intense focus on exponential value creation. Essentially, Buffett's concentrated investments shelter managers from the short-term pressures of the market. Buffett is a notable philanthropist, having pledged to give away 99 percent of his fortune to philanthropic causes, primarily via the Bill & Melinda Gates Foundation. He founded The Giving Pledge in 2009 with Bill Gates, whereby billionaires pledge to give away at least half of their fortunes.",
    "company_website": "https://www.berkshirehathaway.com",
    "country": "USA",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Berkshire_Hathaway.svg/2880px-Berkshire_Hathaway.svg.png",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Warren_Buffett",
    "net_worth": "$100B"
  },
  {
    "full_name": "Larry Ellison",
    "location": "California",
    "industry": "Enterprise software, Cloud computing, Computer hardware",
    "founder_of": "Oracle Corporation",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Larry_Ellison_picture.png/1280px-Larry_Ellison_picture.png",
    "about": "Lawrence Joseph Ellison; born August 17, 1944 is an American business magnate and investor who is a co-founder, the executive chairman and chief technology officer (CTO) of Oracle Corporation. As of April 2021, he was listed by Bloomberg Billionaires Index as the ninth-wealthiest person in the United States and as the tenth-wealthiest in the world, with a fortune of $93.9 billion, increased from $57.3 billion in 2018. He is also the owner of the 41st largest island in the United States, Lanai in the Hawaiian Islands with a population of just over 3000.",
    "company_website": "https://www.oracle.com",
    "country": "USA",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Oracle_logo.svg/2880px-Oracle_logo.svg.png",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Larry_Ellison",
    "net_worth": "$93B"
  },
  {
    "full_name": "Larry Page",
    "location": "California",
    "industry": "Internet Cloud computing, Computer software, Computer hardware, Artificial intelligence, Advertising",
    "founder_of": "Google",
    "image": "https://upload.wikimedia.org/wikipedia/commons/e/ec/Larry_Page_in_the_European_Parliament%2C_17.06.2009_%28cropped%29.jpg",
    "about": "Lawrence Edward Page;born March 26, 1973 is an American computer scientist and Internet entrepreneur. He is best known as one of the co-founders of Google along with Sergey Brin. Page was the chief executive officer of Google from 1997 until August 2001 (stepping down in favor of Eric Schmidt) then from April 2011 until July 2015 when he moved to become CEO of Alphabet Inc. (created to deliver 'major advancements' as Google's parent company), a post he held until December 4, 2019. He remains an Alphabet board member, employee, and controlling shareholder. Creating Google built a significant amount of wealth. According to Bloomberg Billionaires Index, as of April 10, 2021, Page has a net worth of approximately $103.7 billion, making him the 6th-wealthiest person in the world. Page is the co-creator and namesake of PageRank, a search ranking algorithm for Google. He received the Marconi Prize in 2004 with co-writer Brin.",
    "company_website": "https://www.google.com",
    "country": "USA",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Google_2015_logo.svg/2880px-Google_2015_logo.svg.png",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Larry_Page",
    "net_worth": "$103B"
  },
  {
    "full_name": "Sergey Brin",
    "location": "California",
    "industry": "Internet Cloud computing, Computer software, Computer hardware, Artificial intelligence, Advertising",
    "founder_of": "Google",
    "image": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Sergey_Brin_cropped.jpg",
    "about": "Sergey Mikhaylovich Brin; born August 21, 1973 is an American computer scientist and Internet entrepreneur. Together with Larry Page, he co-founded Google. Brin was the president of Google's parent company, Alphabet Inc., until stepping down from the role on December 3, 2019. He and Page remain at Alphabet as co-founders, controlling shareholders, board members, and employees. As of April 2021, Brin is the 8th-richest person in the world, with an estimated net worth of $100.2 billion. Brin immigrated to the United States with his family from the Soviet Union at the age of six. He earned his bachelor's degree at the University of Maryland, College Park, following in his father's and grandfather's footsteps by studying mathematics, as well as computer science. After graduation, he enrolled in Stanford University to acquire a PhD in computer science. There he met Page, with whom he built a web search engine. The program became popular at Stanford, and they suspended their PhD studies to start up Google in Susan Wojcicki's garage in Menlo Park.",
    "company_website": "https://www.google.com",
    "country": "USA",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Google_2015_logo.svg/2880px-Google_2015_logo.svg.png",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Sergey_Brin",
    "net_worth": "$100B"
  },
  {
    "full_name": "Amancio Ortega",
    "location": "Arteixo",
    "industry": "Retail",
    "founder_of": "Zara",
    "image": "https://upload.wikimedia.org/wikipedia/commons/e/e4/Amancio_Ortega_2015_Photograph.jpg",
    "about": "Amancio Ortega Gaona; born 28 March 1936 is a Spanish billionaire businessman. He is the founder and former chairman of Inditex fashion group, best known for its chain of Zara clothing and accessories shops. As of April 2021, Ortega had a net worth of $71 billion, making him the second-wealthiest person in Europe after Bernard Arnault, and the thirteen-wealthiest in the world. For a brief period of time in 2015, he was the richest man in the world, surpassing Bill Gates when his net worth peaked to $80 billion as Zara's parent company, Inditex's, stock peaked. He is the head of the Ortega family and the second wealthiest retailer in the world.",
    "company_website": "https://www.zara.com",
    "country": "Spain",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Zara_Logo.svg/2880px-Zara_Logo.svg.png",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Amancio_Ortega",
    "net_worth": "$71B"
  },
  {
    "full_name": "Mukesh Ambani",
    "location": "Mumbai",
    "industry": "Conglomerate",
    "founder_of": "Reliance Industries Limited",
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/69/Mukesh_Ambani.jpg",
    "about": "Mukesh Dhirubhai Ambani; born 19 April 1957 is an Indian billionaire businessman, and the chairman, managing director, and largest shareholder of Reliance Industries Ltd. (RIL), a Fortune Global 500 company and India's most valuable company by market value. According to Bloomberg Billionaires Index, he is the richest person in Asia with a net worth of US$ 73.8 billion and the 11th richest person in the world, as of 13th May 2021.",
    "company_website": "https://www.ril.com",
    "country": "India",
    "company_logo": "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Reliance_Industries_Logo.svg/1920px-Reliance_Industries_Logo.svg.png",
    "wikipedia_url": "https://en.wikipedia.org/wiki/Mukesh_Ambani",
    "net_worth": "$73B"
  }

]